{
  "article1": "During my internship at Ukietech, I honed my core skills in HTML, CSS, and JavaScript, along with mastering SCSS preprocessing and project bundling using Gulp. This hands-on experience included building a complete project, showcasing responsive design, reusable components, and clean code practices. I collaborated with senior developers, gaining insights into code optimization and debugging techniques. This internship solidified my understanding of frontend development workflows and prepared me to contribute effectively to real-world projects.",
  "article2": "For my first commercial project, I was tasked with developing a fully responsive website based on PSD designs. The project required precise implementation using Bootstrap 4 and adhering to pixel-perfect standards. I ensured the design was faithfully translated into clean and efficient code, focusing on responsiveness, cross-browser compatibility, and maintaining high-quality visuals. This experience strengthened my skills in attention to detail, working independently, and delivering projects within tight deadlines.",
  "article3": "At Codexy Software, I worked as a frontend developer on projects using WordPress, Ruby-on-Rails, and React. During this time, I focused on using pure JavaScript whenever possible instead of relying on jQuery, aiming to improve performance and maintain cleaner code. I also gained limited experience in writing backend logic for Ruby-on-Rails and WordPress. This role helped me sharpen my skills in frontend development, while also expanding my understanding of backend technologies.",
  "article4": "At Soloway Technologies, I began my journey as a backend developer and later transitioned into full-stack development with a stronger emphasis on backend technologies. During this time, I gained hands-on experience with various backend frameworks, sharpening my skills in working with databases. I also developed proficiency in TypeScript and deepened my understanding of cloud services, particularly with AWS and serverless architecture. This role helped me grow my expertise in scalable, cloud-based solutions and advanced backend development practices."
}
